{
  "rule": "Label is True *iff* the entire input is uppercase.",
  "correct": "The input is all uppercase.",
  "distractors": [
    "Every word starts with a vowel.",
    "The input contains a hashtag.",
    "The input ends with a period."
  ],
  "train_pos": [
    "ALL UPPER",
    "HELLO WORLD",
    "GOOD MORNING",
    "MACHINE LEARNING",
    "DATA",
    "OPENAI"
  ],
  "train_neg": [
    "some lower",
    "Mixed CASE",
    "lowercase",
    "Hello World",
    "TensorFlow",
    "Science"
  ],
  "test_pos": [
    "THIS IS AN EXAMPLE OF A POSITIVE CASE",
    "ANOTHER POSITIVE EXAMPLE RIGHT HERE",
    "UPPERCASE LETTERS FROM START TO FINISH",
    "NO LOWERCASE LETTERS IN THIS STRING AT ALL",
    "DIVERSITY IS KEY WHEN GENERATING EXAMPLES",
    "AVOID TRIVIAL PERMUTATIONS AND REPETITION",
    "FIFTY EXAMPLES IS QUITE A LOT OF EXAMPLES",
    "BUT AN AI SYSTEM SHOULD BE UP TO THE TASK",
    "PERHAPS THESE EXAMPLES COULD BE IMPROVED",
    "I WILL LEAVE THAT UP TO THE HUMAN TO DECIDE",
    "EXAMPLES THAT ARE SIMILAR ARE UNDESIRABLE",
    "MIXING IT UP IS MUCH PREFERRED FOR LEARNING",
    "KEEP THE EXAMPLES SIMPLE BUT INTERESTING",
    "THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG",
    "PACK MY BOX WITH FIVE DOZEN LIQUOR JUGS",
    "SPHINX OF BLACK QUARTZ, JUDGE MY VOW",
    "HOW VEXINGLY QUICK DAFT ZEBRAS JUMP",
    "TWO DRIVEN JOCKS HELP FAX MY BIG QUIZ",
    "QUICK ZEPHYRS BLOW, VEXING DAFT JIM",
    "THE FIVE BOXING WIZARDS JUMP QUICKLY",
    "JACKDAWS LOVE MY BIG SPHINX OF QUARTZ",
    "WALTZ, NYMPH, FOR QUICK JIGS VEX BUD",
    "QUICK WAFTING ZEPHYRS VEX BOLD JIM",
    "BRAWNY GODS JUST FLOCKED UP TO QUIZ AND VEX HIM",
    "FEW BLACK TAXIS DRIVE UP MAJOR ROADS ON QUIET HAZY NIGHTS",
    "JUST POETS WAX BOLDLY AS KINGS AND QUEENS FIGHT FOR EXTRA COURAGE",
    "AMAZINGLY FEW DISCOTHEQUES PROVIDE JUKEBOXES BUT LIQUOR FLOWS APLENTY",
    "PACK JUDGES VOW TO FIX KAFKA'S QUIRKY ZEPHYR DEBTS IN A JIFFY",
    "QUICK HIJINX SWIFTLY REVAMPED GAZEBOS AFTER A FREEZING BLIZZARD OCCURRED UNEXPECTEDLY",
    "LUMMOX QUAKED WHILE JIVING WITH SEXY NYMPHS IN THE FROSTY ZEBRA PAVILION",
    "SIXTY ZIPPERS WERE QUICKLY PICKED FROM THE WOVEN JUTE BAG TO BE USED LATER",
    "PUZZLE SOLVERS WERE VEXED BY THE JIGSAWS FEATURING A QUIZZICAL WIZARD AND HIS LYNX",
    "A QUART JAR OF OIL MIXED WITH ZINC OXIDE MAKES A VERY BRIGHT PAINT",
    "JAYWALKING QUICKLY ACROSS THE BOULEVARD DREW HONKS FROM ONCOMING TAXI CABS AND TRUCKS",
    "THE WIZARD QUICKLY JINXED THE GNOMES BEFORE THEY VAPORIZED INTO THIN AIR FOREVER",
    "PACK MY RED BOX WITH FIVE DOZEN QUALITY JUGS OF VODKA AND GIN",
    "FIVE OR SIX BIG JET PLANES ZOOMED QUICKLY BY THE TOWER YESTERDAY AFTERNOON",
    "I QUICKLY EXPLAINED THAT MANY BIG JOBS INVOLVE FEW HAZARDS AND REAL QUALITY WORK",
    "THE PUBLIC WAS AMAZED TO VIEW THE QUICKNESS AND DEXTERITY OF THE JUGGLER AT WORK",
    "MANY QUALITY FABRICS ARE AVAILABLE TODAY BUT NONE MATCH THE VELVET AND SILK FROM INDIA",
    "TURGID SAXOPHONES BLEW OVER THE BAYOU WHILE XYLOPHONISTS WHIZZED THROUGH THE JAZZY FUGUE",
    "WATCH JUVE PLAY BENFICA IN THE NEXT EUROPA LEAGUE QUARTERFINAL MATCH ON WEDNESDAY NIGHT",
    "I EXPECT FIVE QUITE LARGE BOXES JUST FOR THE EXTRA PACKAGING MATERIALS ALONE PLEASE",
    "HUNDREDS OF WILDLY ENTHUSIASTIC FANS JUMPED AND SHRIEKED UPON SEEING THEIR FAVORITE QUARTERBACK ENTER",
    "PLEASE PICK UP FIVE QUARTZ CRYSTALS AND SIX ZINC INGOTS FROM THE METALWORKS SHOP",
    "VERILY THE QUILTING BEE HATH MANY EAGER PARTICIPANTS READY TO WIELD THIMBLES AND NEEDLES",
    "DWARVES IN THE FROZEN NORTH FREQUENTLY ENGRAVE QUIXOTIC EPITHETS AND MAXIMS INTO THEIR AXES",
    "JANE'S GRANDFATHER LOVED TO GO SPELUNKING IN OLD QUARTZ MINES TO FIND GEODES AND AMETHYSTS",
    "BACK IN MY QUAINT GARDEN JAUNTY ZINNIAS VIE WITH FLAUNTING PHLOX FOR THE BEST SHOW"
  ],
  "test_neg": [
    "This example has some lowercase letters",
    "Here is anoTHER example with A mix of CASES",
    "anD one More example With mixed cases for good measure",
    "ALL UPPERCASE EXCEPT FOR THE last word",
    "only The First Letter Of Each Word Is Capitalized In This Example",
    "this example is all lowercase",
    "tHIS EXAMPLE ALTERNATES BETWEEN LOWERCASE AND UPPERCASE LETTERS",
    "I Can't Believe It's Not All Uppercase",
    "uppercase with LOWERCASE punctuation!",
    "Capitalized Words Don't Count As Uppercase",
    "Neither Do Sentences With Only The First Letter Capitalized",
    "examples containing numbers like 123 don't count as uppercase either",
    "Nor do examples with special characters like $%^& or @#*!",
    "'Quotes' and (parentheses) also disqualify an example from being all uppercase",
    "As do hyphens - even if the words are capitalized",
    "UPPERCASe with a single lowercase vowel",
    "ONE lowercaseWORD AMID THE UPPERCASE ONES",
    "numbers at the end of UPPERCASE WORDS 123",
    "special characters &DISPERSED *THROUGHOUT UPPERCASE^ WORDS",
    "no matter HOW you SLICE it, it's NOT all UPPERCASE",
    "eVeN RaNdOm cAsE Is nOt aLL UpPeRcAsE",
    "Capitalized Phrases Are Not The Same As All Uppercase",
    "nEITHER IS tHIS mIX oF cAPITALIZATION aND pUNCTUATION!",
    "sO In sUMMARY - iF It's nOT AlL CaPS, It dOeSN'T CoUNt",
    "ALMOST all UPPERCASE except FOR one LETTER",
    "Tricky - capitalized except for punctuation!",
    "UPPERCASE WORDS 4 interrupted BY a NUMBER",
    "Uppercase sentence with Capitalized words? Nope.",
    "9 NUMBERS at the BEGINNING don't COUNT",
    "Proper Nouns Like John Smith Don't Qualify",
    "Lowercase. Uppercase. A MIXTURE of both.",
    "UPPERCASE (parentheses) or [brackets] - STILL NO",
    "UPPERCASEellipsis... NOT QUITE ALL UPPERCASE",
    "Title Case With Lowercase Words In Between",
    "99.9% UPPERCASE is not 100% uppercase, sadly",
    "Uppercase Sprinkled With 1 Or 2 Lowercase Letters",
    "UPPERCASE + plus + signs != all uppercase",
    "Definitely Not = UPPERCASE WORDS - A FEW",
    "UPPERCASEwordBROKENintoTWOparts",
    "Üppercåse wørds with åccénted lettérs"
  ]
}