{
  "rule": "Label is True *iff* the entire input is lowercase.",
  "correct": "The input is all lowercase.",
  "distractors": [
    "The input ends with an exclamation mark.",
    "The input contains at least one decimal digit.",
    "The input has an even number of characters."
  ],
  "train_pos": [
    "all lowercase",
    "hello world",
    "good morning",
    "machine learning",
    "data science",
    "openai rocks",
    "apple",
    "banana bread",
    "cherry blossom",
    "dandelion",
    "elderberry",
    "forest trail",
    "golden sunrise",
    "honeycomb",
    "ivory tower",
    "jasmine tea",
    "kettle drum",
    "lavender field",
    "maple syrup",
    "nightingale",
    "ocean tide",
    "peppermint",
    "quartz crystal",
    "river stone",
    "saffron spice",
    "tangerine",
    "umbrella pine",
    "violet petal",
    "whispering wind",
    "xylophone",
    "yellowhammer",
    "zephyr breeze",
    "ancient oak",
    "butterfly",
    "cinnamon roll",
    "dragonfly",
    "echo valley",
    "frostbite",
    "garden path",
    "harvest moon",
    "iceberg",
    "jade lantern",
    "kiwi fruit",
    "lighthouse",
    "moonlight",
    "northern lights",
    "olive branch",
    "poppy seed",
    "quilt patch",
    "rosewater",
    "sunflower",
    "teardrop",
    "unicorn",
    "velvet rope",
    "waterfall",
    "yearling"
  ],
  "train_neg": [
    "Some Upper",
    "MIXED case",
    "UPPER",
    "Hello",
    "PyTorch",
    "OpenAI"
  ],
  "test_pos": [
    "the quick brown fox jumps over the lazy dog",
    "sphinx of black quartz, judge my vow",
    "pack my box with five dozen liquor jugs",
    "jackdaws love my big sphinx of quartz",
    "how vexingly quick daft zebras jump",
    "the five boxing wizards jump quickly",
    "quick zephyrs blow, vexing daft jim",
    "two driven jocks help fax my big quiz",
    "waltz, nymph, for quick jigs vex bud",
    "quick wafting zephyrs vex bold jim",
    "six big devils from japan quickly forgot how to waltz",
    "crazy fredrick bought many very exquisite opal jewels",
    "a quick movement of the enemy will jeopardize six gunboats",
    "all questions asked by five watch experts amazed the judge",
    "back in my quaint garden, jaunty zinnias vie with flaunting phlox",
    "five or six big jet planes zoomed quickly by the tower",
    "i quickly explained that many big jobs involve few hazards",
    "the jay, pig, fox, zebra and my wolves quack",
    "blowzy red vixens fight for a quick jump",
    "joaquin phoenix was gazed by mtv for luck",
    "a mad boxer shot a quick, gloved jab to the jaw of his dizzy opponent",
    "jaded zombies acted quaintly but kept driving their oxen forward",
    "my girl wove six dozen plaid jackets before she quit",
    "six big juicy steaks sizzled in a pan as five workmen left the quarry",
    "a quick brown fox jumps over the lazy dog near the bank of the river",
    "we promptly judged antique ivory buckles for the next prize",
    "pack my red box with five dozen quality jugs",
    "sympathizing would fix quaker objectives",
    "a large fawn jumped quickly over white zinc boxes",
    "back in june we delivered oxygen equipment of the same size",
    "just work for improved basic techniques to maximize your typing skill",
    "the jukebox music puzzled a gentle visitor from a quaint valley town",
    "the quick brown fox jumpeth over the lazy dog",
    "jim quickly realized that the beautiful gowns are expensive",
    "the job requires extra pluck and zeal from every young wage earner",
    "mix zany jelly and quick fox charms bev",
    "jack quietly moved up front and seized the big ball of wax",
    "the public was amazed to view the quickness and dexterity of the juggler",
    "mr brown left the bus from the quai bazin and chevy at the junction",
    "the brave knight jumped quickly on his horse to fight with the dragon",
    "grumpy wizards make toxic brew for the evil queen and jack",
    "the expedition reached the lower levels of the cave system without incident",
    "young boys anxiously waited to see the huge elephants perform at the circus",
    "the sleek black sports car drove quickly through the winding mountain roads",
    "my teacher explained the process for photosynthesis in great detail using diagrams",
    "the old man loved sitting in his rocking chair on the front porch",
    "after a long day hiking i quickly fell asleep in my warm sleeping bag",
    "we explored the ancient ruins with great curiosity imagining what life was like",
    "a wise old owl lived in an oak tree near the quiet meadow"
  ],
  "test_neg": [
    "The Quick Brown Fox Jumps Over The Lazy Dog",
    "Sphinx Of Black Quartz, Judge My Vow!",
    "PACK MY BOX WITH FIVE DOZEN LIQUOR JUGS",
    "Jackdaws Love My Big Sphinx Of Quartz.",
    "How Vexingly Quick Daft Zebras Jump!",
    "The Five Boxing Wizards Jump Quickly.",
    "Quick Zephyrs Blow, Vexing Daft Jim.",
    "Two Driven Jocks Help Fax My Big Quiz.",
    "Waltz, Nymph, For Quick Jigs Vex Bud!",
    "Quick Wafting Zephyrs Vex Bold Jim.",
    "Six Big Devils From Japan Quickly Forgot How To Waltz.",
    "Crazy Fredrick Bought Many Very Exquisite Opal Jewels.",
    "A Quick Movement Of The Enemy Will Jeopardize Six Gunboats.",
    "All Questions Asked By Five Watch Experts Amazed The Judge.",
    "Back In My Quaint Garden, Jaunty Zinnias Vie With Flaunting Phlox.",
    "Five Or Six Big Jet Planes Zoomed Quickly By The Tower!",
    "I Quickly Explained That Many Big Jobs Involve Few Hazards.",
    "The Jay, Pig, Fox, Zebra And My Wolves Quack!",
    "Blowzy Red Vixens Fight For A Quick Jump.",
    "Joaquin Phoenix Was Gazed By MTV For Luck.",
    "A Mad Boxer Shot A Quick, Gloved Jab To The Jaw Of His Dizzy Opponent.",
    "Jaded Zombies Acted Quaintly But Kept Driving Their Oxen Forward.",
    "My Girl Wove Six Dozen Plaid Jackets Before She Quit.",
    "Six Big Juicy Steaks Sizzled In A Pan As Five Workmen Left The Quarry.",
    "A Quick Brown Fox Jumps Over The Lazy Dog Near The Bank Of The River.",
    "We Promptly Judged Antique Ivory Buckles For The Next Prize.",
    "Pack My Red Box With Five Dozen Quality Jugs!",
    "Sympathizing Would Fix Quaker Objectives.",
    "A Large Fawn Jumped Quickly Over White Zinc Boxes.",
    "Back In June We Delivered Oxygen Equipment Of The Same Size.",
    "Just Work For Improved Basic Techniques To Maximize Your Typing Skill!",
    "The Jukebox Music Puzzled A Gentle Visitor From A Quaint Valley Town.",
    "The Quick Brown Fox Jumpeth Over The Lazy Dog!",
    "Jim Quickly Realized That The Beautiful Gowns Are Expensive.",
    "The Job Requires Extra Pluck And Zeal From Every Young Wage Earner.",
    "Mix Zany Jelly And Quick Fox Charms Bev!",
    "Jack Quietly Moved Up Front And Seized The Big Ball Of Wax.",
    "The Public Was Amazed To View The Quickness And Dexterity Of The Juggler.",
    "Mr Brown Left The Bus From The Quai Bazin And Chevy At The Junction.",
    "The Brave Knight Jumped Quickly On His Horse To Fight With The Dragon!",
    "Grumpy Wizards Make Toxic Brew For The Evil Queen And Jack.",
    "Tha expedition reached tha lower levels of tha cave system without incident.",
    "Young Boyz anxiously waited 2 C tha huge elephants perform @ tha circus!",
    "tHE sleek black sports car drove quickly through the winding mountain roads.",
    "My Teacher Explained The Process For Photosynthesis In Great Detail Using Diagrams.",
    "The Old Man Loved Sitting In His Rocking Chair On The Front Porch.",
    "After A Long Day Hiking I Quickly Fell Asleep In My Warm Sleeping Bag.",
    "WE EXPLORED THE ANCIENT RUINS WITH GREAT CURIOSITY IMAGINING WHAT LIFE WAS LIKE!",
    "a WISE old owl lived in an oak tree near THE quiet MEADOW.",
    "She sells sea-shells by the sea shore."
  ]
}