{
  "rule": "Label is True *iff* the input contains an English color word.",
  "correct": "The input contains an English color word.",
  "distractors": [
    "The input starts with a vowel.",
    "The input has an odd number of characters.",
    "The input ends with “.com”."
  ],
  "train_pos": [
    "blue sky",
    "red rose",
    "green grass",
    "bright yellow",
    "black cat",
    "white snow"
  ],
  "train_neg": [
    "clear sky",
    "pinkish hue",
    "gray area",
    "sunny day",
    "colorless",
    "shade"
  ],
  "test_pos": [
    "The sky was a brilliant blue today.",
    "She wore a stunning emerald green dress to the gala.",
    "Sunflowers are known for their vibrant yellow petals.",
    "The sunset painted the clouds in hues of orange and pink.",
    "His favorite color is a deep, rich purple.",
    "The leaves turned a beautiful shade of red in the autumn.",
    "The car was a sleek, glossy black.",
    "The daffodils added a pop of bright yellow to the garden.",
    "The forest was a lush green after the spring rains.",
    "The old book had pages that were yellowed with age.",
    "He loved the bold, fiery red of his new sports car.",
    "She added a splash of lime green to the room with throw pillows.",
    "He preferred shirts in shades of navy blue.",
    "The autumn leaves were a mix of amber, orange, and red.",
    "She painted the ceiling a soft, creamy white.",
    "The old copper pot had developed a greenish patina.",
    "The leaves of the plant were a deep, forest green.",
    "He loved the warm, buttery yellow of the kitchen walls.",
    "The tanzanite gemstone had a unique bluish-purple hue.",
    "The sky was a pale, icy blue on the winter morning.",
    "The pumpkins in the patch were a bright, cheerful orange.",
    "The chrysanthemums came in shades of white, yellow, and rust.",
    "The red and white stripes of the candy cane were eye-catching.",
    "He added a touch of olive green to the room with an accent wall.",
    "The plum-colored curtains added a regal touch to the room.",
    "She wore a pendant with a stunning cerulean blue stone.",
    "He chose a shirt in a pale shade of mint green."
  ],
  "test_neg": [
    "The cat lazily stretched out in the warm sun.",
    "She always starts her day with a cup of coffee.",
    "He enjoys listening to jazz music in the evenings.",
    "The old oak tree had a trunk that was gnarled and twisted.",
    "She loves the sound of rain pattering on the roof.",
    "He has a collection of vintage postcards from his travels.",
    "The smell of freshly baked bread filled the kitchen.",
    "She always keeps a journal to write down her thoughts.",
    "He enjoys going for long hikes in the mountains.",
    "The birds chirped cheerfully in the trees.",
    "She has a talent for playing the piano.",
    "He likes to relax by reading a good book.",
    "The wind whistled through the branches of the trees.",
    "She enjoys trying new recipes in the kitchen.",
    "He has a fondness for collecting unique coins.",
    "The leaves crunched beneath their feet as they walked.",
    "She loves the feeling of sand between her toes at the beach.",
    "He enjoys stargazing on clear summer nights.",
    "The sound of laughter filled the room.",
    "She has a knack for solving crossword puzzles.",
    "He likes to go fishing on the weekends.",
    "The aroma of vanilla and cinnamon wafted from the oven.",
    "She enjoys taking photographs of nature.",
    "He has a collection of antique pocket watches.",
    "The grass was soft and cool beneath their bare feet.",
    "She loves the sound of waves crashing on the shore.",
    "He enjoys playing chess with his friends.",
    "She has a passion for painting landscapes.",
    "He likes to go for bike rides on sunny afternoons.",
    "The crickets chirped in the stillness of the night.",
    "She enjoys practicing yoga in the mornings.",
    "He has a talent for woodworking and crafting furniture.",
    "The stars twinkled brightly in the clear night sky.",
    "She loves the smell of freshly cut grass.",
    "He enjoys going to the theater to watch plays.",
    "The river flowed gently through the countryside.",
    "She has a collection of rare first edition books.",
    "He likes to go camping in the great outdoors.",
    "The snow crunched beneath their boots as they walked.",
    "She enjoys taking long, relaxing bubble baths.",
    "He has a fondness for solving complex math equations.",
    "The leaves rustled in the gentle breeze.",
    "She loves the taste of freshly squeezed lemonade.",
    "He enjoys playing the guitar and writing his own songs.",
    "The fog rolled in, blanketing the city in a misty haze.",
    "She has a talent for knitting cozy sweaters and scarves.",
    "He likes to go on road trips and explore new places.",
    "The bees buzzed from flower to flower, collecting nectar.",
    "She enjoys doing puzzles and brain teasers in her free time."
  ]
}