{
  "rule": "Label is True *iff* the input contains an emotion word (happy, sad, angry).",
  "correct": "The input contains an emotion word.",
  "distractors":[
    "The input contains a Roman numeral.",
    "The input contains a temperature in °C or °F.",
    "The input contains a hashtag."
  ],
  "train_pos": [
    "I am happy",
    "she feels sad",
    "angry birds",
    "happy day",
    "so sad",
    "not angry"
  ],
  "train_neg": [
    "emotionless",
    "neutral mood",
    "joyful",
    "upset",
    "content",
    "excited"
  ],
  "test_pos": [
    "I was so happy when I got the promotion at work!",
    "She felt an overwhelming sense of sadness after the breakup.",
    "The political corruption made him feel angry and powerless.",
    "The surprise party put a huge smile on her face and made her very happy.",
    "I get really angry when people are rude for no reason.",
    "Watching that movie made me feel so sad, I cried for hours afterwards.",
    "He was angry that his roommate kept eating his food without asking.",
    "I felt a deep sadness when I heard about the tragedy on the news.",
    "The boss's unrealistic demands were making all the employees angry.",
    "The puppy was so cute, it instantly made everyone happy.",
    "She was angry at herself for forgetting to pay the bills on time.",
    "Losing his job right before the holidays made him extremely sad.",
    "I was happy to finally cross that item off my bucket list.",
    "The gloomy weather outside matched her sad mood perfectly.",
    "He got angry when someone cut him off in traffic.",
    "She was so happy she practically skipped down the street.",
    "I always feel a bit sad when I finish a really good book.",
    "The protesters were visibly angry as they marched and chanted slogans.",
    "Spending time with family and friends never fails to make me happy.",
    "She felt sad that summer was ending and school was about to start again.",
    "I could tell he was angry by the way he clenched his fists.",
    "Hearing my favorite song on the radio made me inexplicably happy.",
    "The movie had such a sad ending that there wasn't a dry eye in the theater.",
    "Dancing always puts me in a happy mood, no matter what.",
    "Saying goodbye to a beloved pet would make anyone sad.",
    "I was angry when I found out my friend had been spreading rumors about me.",
    "She was so happy when her boyfriend proposed, she couldn't stop smiling.",
    "Rainy days in the fall sometimes make me feel melancholy and sad.",
    "He got angry and defensive anytime someone criticized him.",
    "The news that she got accepted to her dream school made her incredibly happy.",
    "I feel profound sadness when I think about homeless animals.",
    "Blowing out birthday candles always makes people smile and feel happy.",
    "The poem about loss and grief was hauntingly sad.",
    "I get really angry when I see examples of injustice and inequality.",
    "Saying goodbye to a good friend who is moving away is always sad.",
    "Many people feel sad when they remember a loved one who passed away.",
    "I was angry that the company tried to cheat me out of my refund.",
    "She wore a happy smile as she walked hand-in-hand with her new love.",
    "Listening to sad songs after a breakup can be cathartic.",
    "He got angry way too easily and it was starting to affect his relationships.",
    "The beautiful wedding ceremony made everyone feel happy for the couple.",
    "It's normal for kids to feel sad on the first day of school."
  ],
  "test_neg": [
    "The sky was a clear, vibrant blue with a few wispy clouds.",
    "He nervously adjusted his tie before walking into the job interview.",
    "The garden was filled with fragrant flowers of every color.",
    "She had a calm, peaceful demeanor that put others at ease.",
    "The old, rusty gate creaked eerily as it swung open.",
    "He had an adventurous spirit and was always seeking new thrills.",
    "The cozy cafe had a warm, inviting atmosphere that drew people in.",
    "She approached the challenging task with determination and focus.",
    "The majestic mountains loomed in the distance, beckoning to hikers.",
    "His laugh was contagious and always lightened the mood.",
    "The winding road led through a dense, lush forest.",
    "She had an insatiable curiosity and love for learning new things.",
    "The historic ruins held countless untold stories of the past.",
    "He was a natural leader who inspired others with his vision.",
    "The soothing sound of ocean waves crashing on the shore was relaxing.",
    "She had a witty sense of humor that always made people chuckle.",
    "The brilliant sunset painted the sky in vibrant oranges and pinks.",
    "He faced his fears head-on with courage and came out stronger.",
    "The savory aroma of the simmering stew made my mouth water.",
    "She was a true artist, expressing her unique view of the world.",
    "The dense fog created an eerie, otherworldly atmosphere.",
    "His kindness and compassion towards others was truly admirable.",
    "The ancient oak tree stood tall and proud, a silent guardian.",
    "She found joy and fulfillment in helping those in need.",
    "The roaring waterfall created a refreshing mist in the air.",
    "He had a creative mind that was always dreaming up new ideas.",
    "The delicate snowflakes drifted down from the gray winter sky.",
    "She was a pillar of strength for her loved ones during tough times.",
    "The winding hiking trail led to a breathtaking vista.",
    "His dedication and hard work were an inspiration to his colleagues.",
    "The quirky, colorful houses gave the neighborhood character.",
    "She had a deep appreciation for the simple beauty in life.",
    "The powerful hurricane left a trail of destruction in its wake.",
    "He could always see the positive in any situation.",
    "The misty forest seemed like something out of a fairy tale.",
    "She was a born performer who loved the thrill of the stage.",
    "The towering skyscrapers were a symbol of the city's ambition.",
    "His calm confidence put others at ease during times of crisis.",
    "The fields of wildflowers stretched out as far as the eye could see.",
    "She had an infectious enthusiasm that motivated those around her.",
    "The ominous dark clouds forewarned of the impending storm.",
    "He took pride in his work and always gave his best effort.",
    "The intricate ice sculptures sparkled in the winter sun.",
    "She had a heart full of love and compassion for all living things.",
    "The winding river cut through the valley like a blue ribbon.",
    "His unwavering loyalty and dependability made him a true friend.",
    "The mesmerizing northern lights danced across the night sky.",
    "She found solace in writing and expressing her innermost thoughts.",
    "The first spring blooms brought a welcome burst of color and life."
  ]
}