{
  "rule": "Label is True *iff* the input contains a hashtag (#).",
  "train_pos": [
    "love this #photo",
    "#sunset vibes",
    "check #AI",
    "using #python",
    "#fun times",
    "coding in #ML"
  ],
  "train_neg": [
    "love this photo",
    "sunset vibes",
    "check AI",
    "using python",
    "fun times",
    "coding in ML"
  ],
  "test_pos": [
    "I love using hashtags! #hashtag #fun #socialmedia",
    "Just saw the new #SpiderMan movie. It was amazing! #Marvel",
    "Can't wait for the weekend! #TGIF #FridayFeeling",
    "Enjoying a beautiful sunset. #nature #peace #bliss",
    "Happy #NationalCoffeeDay! Grabbing my favorite brew. ☕",
    "Excited to announce my new #podcast launch! Check it out. 🎙️",
    "#TBT to that incredible vacation last summer. Take me back! ☀️",
    "Nothing beats a good #workout to start the day. 💪 #fitness",
    "Trying out a new #recipe for dinner tonight. Wish me luck! 🍳",
    "Absolutely loving my new #iPhone! The camera is incredible. 📸",
    "Just finished a great #book. Highly recommend it! 📚 #reading",
    "Feeling inspired after attending that #conference. Learned so much!",
    "#Foodie adventures: Discovered the best tacos in town! 🌮 #nom",
    "Can't stop listening to this #newmusic. It's on repeat! 🎧",
    "Celebratingmy #birthday today! Another year older and wiser. 🎂",
    "Enjoying the #sunshine and fresh air at the park. ☀️ #outdoors",
    "Just booked my #vacation! Counting down the days. ✈️ #travel",
    "Throwback to college with this old #photo. Those were the days!",
    "Taking on a new #challenge. Ready to push myself! 💪 #motivation",
    "Tried aerial yoga for the first time. #NewExperience #fitness",
    "Supporting my favorite #charity at their annual gala. #giveback",
    "Enjoying a cozy night in with #netflix and popcorn. 🍿 #hygge",
    "Excited to collaborate with fellow #creators at the summit. 🤝",
    "Just adopted a new #puppy! Meet the latest addition to my family. 🐶",
    "Celebrating #Pride month and spreading love. 🌈 #LoveIsLove",
    "Exploring the city and finding hidden #streetart gems. 🎨 #urban",
    "Challenging myself with a new #hiking trail today. 🥾 #adventure",
    "Raising awareness for an important #cause. Together we can change lives.",
    "#Minimalism challenge: Decluttering my space and mind. 🧘 #simplify",
    "Diving into a new #codingproject. Excited to build something! 💻",
    "Enjoying the festive #holiday season with loved ones. ❤️ #family",
    "Just finished an intense #HIIT workout. Feeling accomplished! 😅",
    "Exploring a new #neighborhood and trying local #cuisine. 😋🍴",
    "#Wanderlust has me dreaming of my next adventure. ✈️ #travelgram",
    "Reflecting on personal #growth and lessons learned. 📝 #selflove",
    "Celebrating the launch of a new #product! Proud of the team. 🚀",
    "Enjoying a relaxing #SpaDay. Treating myself! 💆 #selfcare",
    "Learning a new #language with daily practice. #DuolingoStreak 🌍",
    "Attending a fascinating #lecture on the future of technology. 🤖",
    "#Monstera Monday! Sharing my love for houseplants. 🌿 #urbanjungle",
    "Checking out a trendy new #restaurant in town. #foodie 🍽️",
    "Sharing my #MorningRoutine for a productive day. ☀️ #riseandshine",
    "Enjoying a fun night of #boardgames with friends. 🎲 #gamenight",
    "Embarking on a #roadtrip adventure. Next stop, unknown! 🚗💨",
    "Just finished an epic #marathon. Proud of my accomplishment! 🏅",
    "Trying out #veganrecipes for a plant-based lifestyle. 🌱 #healthy",
    "Attending a #livemusic show. Nothing beats the energy! 🎸 #concert",
    "Excited for the #Oscars tonight! Rooting for my favorite films. 🎥",
    "Participating in a #beachcleanup to help the environment. 🌊 #savetheoceans"
  ],
  "test_neg": [
    "I don't really understand the point of using hashtags.",
    "My weekend plans include reading, hiking, and catching up on sleep.",
    "Just finished an interesting book about the history of aviation.",
    "Trying out a new recipe for homemade pizza tonight. Fingers crossed!",
    "Listening to some classic jazz albums on vinyl. So relaxing.",
    "Thinking about learning a new language. Maybe French or Japanese?",
    "Went for a scenic drive through the countryside. Beautiful views.",
    "Curled up on the couch with a cozy blanket and a cup of tea.",
    "Reminiscing about old childhood memories. Simpler times.",
    "Brainstorming ideas for a short story I want to write.",
    "Had an insightful conversation with a wise older friend today.",
    "Practicing mindfulness and being present in the moment.",
    "Treated myself to a bouquet of fresh flowers. Brightens up the room.",
    "Exploring new hobbies and creative outlets. Trying watercolor painting.",
    "Decluttering my workspace for a more organized and productive environment.",
    "Enjoying the peace and quiet of an early morning walk.",
    "Researching volunteer opportunities to get more involved in my community.",
    "Planning a cozy game night with close friends. Board games and snacks!",
    "Learning about sustainable living and making eco-friendly changes.",
    "Trying to break my procrastination habit and tackle tasks head-on.",
    "Reflecting on my personal growth journey. Celebrating small victories.",
    "Spending quality time with my grandparents. Cherishing their wisdom.",
    "Experimenting with different meditation techniques for stress relief.",
    "Attending a local farmer's market. Supporting small businesses.",
    "Just booked tickets to a theater show. Excited for a cultural experience!",
    "Enjoying the simple pleasure of people-watching at a café.",
    "Planning a surprise party for my best friend's birthday.",
    "Learning about investing and financial planning for the future.",
    "Had a heartfelt phone call with an old friend. Reconnecting feels good.",
    "Trying out a new form of exercise. Signed up for kickboxing classes!",
    "Exploring the concept of minimalism. Living with less material possessions.",
    "Engaging in philosophical discussions about the meaning of life.",
    "Practicing gratitude and appreciating the little things.",
    "Attending a poetry reading event. Moved by the power of words.",
    "Learning magic tricks to entertain my little nieces and nephews.",
    "Baking homemade bread from scratch. The smell is heavenly!",
    "Enjoying a relaxing bubble bath with soothing essential oils.",
    "Planning a themed dinner party. Cooking dishes from around the world.",
    "Taking an online course to learn a new professional skill.",
    "Participating in a book club. Expanding my literary horizons.",
    "Trying to break my smartphone addiction. Digital detox challenge!",
    "Exploring spirituality and different belief systems. Seeking inner peace.",
    "Playing tourist in my own city. Visiting local landmarks.",
    "Starting a gratitude journal. Focusing on the positive.",
    "Learning the basics of car maintenance. Changing my own oil.",
    "Practicing random acts of kindness. Spreading joy to others.",
    "Taking a solo trip for self-discovery and personal growth.",
    "Researching my family tree and genealogy. Uncovering my roots.",
    "Attending a silent retreat. Embracing stillness and introspection.",
    "Exploring the fascinating world of lucid dreaming. Controlling my dreams."
  ]
}