{
  "rule": "Label is True *iff* the input contains a date like DD/MM or YYYY-MM-DD.",
  "train_pos": [
    "today is 01/01",
    "event on 2025-05-14",
    "birthday 19/05",
    "deadline 2024-12-31",
    "report 30/06",
    "1999-07-04 party"
  ],
  "train_neg": [
    "today is tomorrow",
    "event soon",
    "birthday next week",
    "deadline year end",
    "report later",
    "party time"
  ],
  "test_pos": [],
  "test_neg": [
    "I love watching sunsets over the ocean.",
    "The recipe calls for two cups of flour and a teaspoon of vanilla.",
    "She wore a beautiful blue dress to the gala.",
    "The old oak tree in the park is over a hundred years old.",
    "He always takes his coffee with two sugars and no cream.",
    "The children laughed and played in the sprinklers all afternoon.",
    "The hike to the top of the mountain was challenging but worth it.",
    "She studied hard for weeks before the final exam.",
    "The farmer's market sells the freshest produce in town.",
    "He proposed to her on a romantic walk along the beach.",
    "The band played their greatest hits to a packed stadium.",
    "The detective carefully examined the crime scene for clues.",
    "She spent hours sketching the intricate details of the architecture.",
    "The bakery down the street makes the most delicious pastries.",
    "He gave an inspiring speech that motivated the entire team.",
    "The sunset painted the sky in a breathtaking array of colors.",
    "She expertly navigated the busy city streets during rush hour.",
    "The author's latest novel was an instant bestseller.",
    "He won the championship with a buzzer-beater shot.",
    "The dancers moved gracefully across the stage in perfect unison.",
    "She volunteers at the animal shelter every weekend.",
    "The professor's lecture was engaging and thought-provoking.",
    "He spent months training for the marathon.",
    "The artist's paintings were displayed in a prestigious gallery.",
    "She sang a beautiful rendition of the national anthem.",
    "The chef's signature dish was a masterpiece of flavors.",
    "He taught himself to play the guitar and now performs in a band.",
    "The journalist broke the story that led to a major investigation.",
    "She won a scholarship to study abroad for a year.",
    "The magician's illusions left the audience in awe.",
    "He built a treehouse for his children in the backyard.",
    "The violinist's performance was met with a standing ovation.",
    "She wrote a heartfelt letter to her grandparents.",
    "The firefighters bravely battled the blaze for hours.",
    "He created a beautiful sculpture out of recycled materials.",
    "The therapist helped her clients work through their challenges.",
    "She organized a successful fundraiser for the school.",
    "The pilot skillfully landed the plane in difficult weather conditions.",
    "He won the chess tournament with a brilliant strategy.",
    "The florist created stunning arrangements for the wedding.",
    "She gave a moving eulogy at her grandmother's funeral.",
    "The architect designed an innovative and sustainable building.",
    "He coached the little league team to a championship victory.",
    "The poet's words touched the hearts of readers everywhere.",
    "She advocated for social justice and equality.",
    "The mechanic fixed the car's engine with impressive skill.",
    "He captured stunning photographs of wildlife on the safari.",
    "The nurse provided compassionate care to her patients.",
    "She wrote and directed an award-winning short film.",
    "The gardener cultivated a beautiful and bountiful harvest."
  ]
}