{
  "rule": "Label is True *iff* the input contains $, €, £ or ¥.",
  "train_pos": [
    "cost is $5",
    "price €10",
    "worth £30",
    "amount ¥500",
    "$100 deal",
    "€2"
  ],
  "train_neg": [
    "cost is five",
    "price ten",
    "worth thirty",
    "amount 500",
    "deal",
    "money"
  ],
  "test_pos": [
    "The price is $19.99 for the book.",
    "It costs €7.50 to take the bus downtown.",
    "The fancy watch was priced at £495.",
    "¥1000 is the fare for the high-speed train.",
    "Convert your $ to € at the currency exchange.",
    "I paid £8.99 for the magazine subscription.",
    "The artisan crafted vase was selling for ¥15000.",
    "Admission to the museum is €12 for adults.",
    "The antique lamp sold at auction for $3,750.",
    "Lunch at the cafe came to £11.50.",
    "The imported silk scarf cost ¥8800.",
    "Rent for the apartment is $1,200 per month.",
    "I exchanged $100 for €85 at the bank.",
    "The handmade quilt was priced at £350.",
    "A first-class stamp costs ¥84.",
    "The vintage record player sold for $275.",
    "Dinner for two at the bistro was €65.",
    "I bought the cashmere sweater for £120.",
    "The limited edition print was $450.",
    "Roundtrip airfare to Tokyo is ¥180,000.",
    "The designer handbag retails for €1,195.",
    "I paid £4.50 for a cup of coffee.",
    "The hand-thrown pottery bowl cost $95.",
    "Tuition for the semester is $8,500.",
    "I found a great deal on a £29 hotel room.",
    "The imported chocolate bar was priced at €3.99.",
    "A one-day ski pass costs ¥6,500.",
    "I spent $50 on groceries this week.",
    "The vintage wine sold for £225 at the shop.",
    "Tickets to the concert were €79 each.",
    "I bought a ¥500 gift card for my friend.",
    "The handcrafted leather boots cost $350.",
    "Rent for the beach house is £1,500 per week.",
    "I paid €18 for a cocktail at the bar.",
    "The collectible coin was valued at $2,200.",
    "A yearlong gym membership is ¥75,000.",
    "I donated £100 to the animal shelter.",
    "The gourmet chocolate truffles were $24 for a box.",
    "I paid €5.99 for a magazine at the airport.",
    "The bespoke suit cost £1,200.",
    "Parking downtown is $3.50 per hour.",
    "I bought a ¥1,500 train pass for the month.",
    "The vintage movie poster sold for €350.",
    "A day pass for the theme park is £45.",
    "I spent $75 on a new pair of running shoes.",
    "The farm-to-table dinner was priced at €110 per person.",
    "I found a beautiful silk kimono for ¥28,000.",
    "The collectors edition book cost £175.",
    "I paid $12.99 for the streaming service subscription.",
    "The hand-painted ceramic mug was €22."
  ],
  "test_neg": [
    "The price for the book is nineteen dollars and ninety-nine cents.",
    "It costs seven euros and fifty cents to take the bus downtown.",
    "The fancy watch was priced at four hundred ninety-five pounds.",
    "One thousand yen is the fare for the high-speed train.",
    "Convert your dollars to euros at the currency exchange.",
    "I paid eight pounds and ninety-nine pence for the magazine subscription.",
    "The artisan crafted vase was selling for fifteen thousand yen.",
    "Admission to the museum is twelve euros for adults.",
    "The antique lamp sold at auction for three thousand seven hundred fifty dollars.",
    "Lunch at the cafe came to eleven pounds and fifty pence.",
    "The imported silk scarf cost eight thousand eight hundred yen.",
    "Rent for the apartment is one thousand two hundred dollars per month.",
    "I exchanged one hundred dollars for eighty-five euros at the bank.",
    "The handmade quilt was priced at three hundred and fifty pounds.",
    "A first-class stamp costs eighty-four yen.",
    "The vintage record player sold for two hundred seventy-five dollars.",
    "Dinner for two at the bistro was sixty-five euros.",
    "I bought the cashmere sweater for one hundred twenty pounds.",
    "The limited edition print was four hundred fifty dollars.",
    "Roundtrip airfare to Tokyo is one hundred eighty thousand yen.",
    "The designer handbag retails for one thousand one hundred ninety-five euros.",
    "I paid four pounds and fifty pence for a cup of coffee.",
    "The hand-thrown pottery bowl cost ninety-five dollars.",
    "Tuition for the semester is eight thousand five hundred dollars.",
    "I found a great deal on a twenty-nine pound hotel room.",
    "The imported chocolate bar was priced at three euros and ninety-nine cents.",
    "A one-day ski pass costs six thousand five hundred yen.",
    "I spent fifty dollars on groceries this week.",
    "The vintage wine sold for two hundred twenty-five pounds at the shop.",
    "Tickets to the concert were seventy-nine euros each.",
    "I bought a five hundred yen gift card for my friend.",
    "The handcrafted leather boots cost three hundred fifty dollars.",
    "Rent for the beach house is one thousand five hundred pounds per week.",
    "I paid eighteen euros for a cocktail at the bar.",
    "The collectible coin was valued at two thousand two hundred dollars.",
    "A yearlong gym membership is seventy-five thousand yen.",
    "I donated one hundred pounds to the animal shelter.",
    "The gourmet chocolate truffles were twenty-four dollars for a box.",
    "I paid five euros and ninety-nine cents for a magazine at the airport.",
    "The bespoke suit cost one thousand two hundred pounds.",
    "Parking downtown is three dollars and fifty cents per hour.",
    "I bought a one thousand five hundred yen train pass for the month.",
    "The vintage movie poster sold for three hundred fifty euros.",
    "A day pass for the theme park is forty-five pounds.",
    "I spent seventy-five dollars on a new pair of running shoes.",
    "The farm-to-table dinner was priced at one hundred ten euros per person.",
    "I found a beautiful silk kimono for twenty-eight thousand yen.",
    "The collectors edition book cost one hundred seventy-five pounds.",
    "I paid twelve dollars and ninety-nine cents for the streaming service subscription.",
    "The hand-painted ceramic mug was twenty-two euros."
  ]
}