{
  "rule": "Label is True *iff* the character count is even.",
  "train_pos": [
    "abcd",
    "1234",
    "even",
    "length",
    "python3",
    "!!"
  ],
  "train_neg": [
    "abc",
    "123",
    "odd",
    "hey",
    "!",
    "seven7"
  ],
  "test_pos": [
    "The quick brown fox jumps over the lazy dog.",
    "I love eating pizza and watching movies at home.",
    "She sells seashells by the seashore on sunny days.",
    "He played guitar and sang songs around the campfire.",
    "They went hiking in the mountains and saw beautiful views.",
    "She wrote poetry in her journal every night before going to bed.",
    "The cat slept on the windowsill and watched birds outside all day.",
    "She knitted scarves and hats for her loved ones during the holidays.",
    "He collected stamps and coins as a hobby since he was a child.",
    "The bird built a nest in the tree and laid eggs in the spring.",
    "She sewed her own clothes and made unique fashion designs.",
    "He played chess with his grandfather and learned new strategies.",
    "They rode bikes on the trail and explored the forest nearby.",
    "The fish swam in the aquarium and hid behind colorful coral.",
    "She grew roses and tulips in her garden and made beautiful bouquets.",
    "He read science fiction novels before bed to relax and unwind.",
    "She made jewelry with beads and wire and sold it online.",
    "He went fishing at the lake and caught bass and trout.",
    "The butterfly fluttered from flower to flower in search of nectar.",
    "She practiced yoga and meditation to reduce stress and find inner peace.",
    "He played the piano and composed music in his free time.",
    "He played video games with friends online in his spare time.",
    "They went to the carnival and rode the Ferris wheel and roller coasters.",
    "The turtle basked in the sun on a log in the middle of the pond.",
    "The dragonfly zipped through the air and landed on a lily pad.",
    "She practiced archery and competed in tournaments on weekends.",
    "The quick brown fox jumps over the lazy dog.",
    "I love to eat pizza and pasta on weekends.",
    "She sells seashells by the seashore.",
    "The sun is shining brightly today.",
    "I am excited about my upcoming vacation.",
    "The gentle breeze feels nice on my skin.",
    "I can't wait to try that new restaurant in town!",
    "The flowers in the garden are in full bloom.",
    "The stars twinkle brightly in the night sky.",
    "The rainbow after the rain is a beautiful sight.",
    "I enjoy taking long walks in nature.",
    "The taste of homemade ice cream is divine.",
    "The scent of lavender is calming and relaxing.",
    "I enjoy trying out new recipes in the kitchen.",
    "The sound of laughter is contagious and uplifting.",
    "I find peace in practicing meditation daily.",
    "I am excited to embark on a new adventure.",
    "The taste of a perfectly ripe mango is heavenly.",
    "I am learning to appreciate the little things in life.",
    "The sound of a babbling brook is peaceful.",
    "I enjoy exploring new cities and cultures.",
    "The feeling of accomplishment after a hard day's work.",
    "I am grateful for the opportunities life has given me.",
    "The sound of a crackling campfire is comforting."
  ],
  "test_neg": [
    "They enjoy hiking in the mountains on weekends.",
    "He collects rare coins as a hobby and investment.",
    "She paints beautiful landscapes in her free time.",
    "She knits cozy sweaters for her family and friends.",
    "They play board games on rainy Sunday afternoons.",
    "He tinkers with old cars and restores them.",
    "She grows herbs and vegetables in her garden.",
    "They ride bikes along the scenic river trail.",
    "He plays chess with his grandfather every week.",
    "She sews her own clothes and designs fashion.",
    "They watch classic movies at the vintage theater.",
    "She studies foreign languages and cultures.",
    "He plays video games with online friends.",
    "They go stargazing in the countryside at night.",
    "The butterfly flutters from flower to flower.",
    "They volunteer at the local animal shelter.",
    "They attend art gallery openings in the city.",
    "He builds custom furniture in his workshop.",
    "They explore hidden waterfalls in the forest.",
    "The hummingbird hovers near the feeder.",
    "She writes poetry and shares it at open mic nights.",
    "She volunteers at the community garden project.",
    "The sky is a vibrant shade of blue today.",
    "I love the sound of leaves crunching beneath my feet.",
    "I am excited to start a new chapter in my life.",
    "I enjoy the challenge of solving complex puzzles.",
    "The sound of waves crashing on the shore is soothing.",
    "I am grateful for the lessons life has taught me.",
    "The taste of a cold, refreshing glass of lemonade on a hot day.",
    "The scent of vanilla is comforting and nostalgic.",
    "I enjoy the thrill of trying new foods from different cultures.",
    "I love the feeling of accomplishment after reaching a goal.",
    "The sound of wind chimes in a gentle breeze is calming.",
    "I am excited to see what the future holds for me.",
    "The taste of a warm, gooey chocolate chip cookie is heavenly.",
    "The scent of cinnamon and spice reminds me of the holidays.",
    "I enjoy the challenge of learning a new skill or hobby.",
    "I am grateful for the simple pleasures in life.",
    "I enjoy the excitement of exploring a new city or town.",
    "I am excited to learn and grow as a person.",
    "The taste of a juicy, sweet watermelon on a summer day.",
    "The scent of freshly baked cookies is mouth-watering.",
    "I enjoy the challenge of pushing myself out of my comfort zone.",
    "The beauty of a field of sunflowers stretching towards the sky.",
    "I love the feeling of a soft, cozy blanket on a cold night.",
    "The sound of a brook babbling over rocks is serene.",
    "I am grateful for the beauty and wonder of the natural world.",
    "The scent of a fresh ocean breeze is invigorating and refreshing."
  ]
}