{
  "rule": "Label is True *iff* the input has more than three words.",
  "train_pos": [
    "this has four words",
    "five words are here",
    "count these six words",
    "seven words in this example",
    "exactly four word phrase",
    "lots of words in this sentence"
  ],
  "train_neg": [
    "just three words",
    "only two",
    "one",
    "hello world",
    "hi there",
    "tiny phrase"
  ],
  "test_pos": [
    "The quick brown fox jumps over the lazy dog.",
    "I love to eat pizza with extra cheese and pepperoni.",
    "She sells seashells by the seashore on sunny days.",
    "He drove his car through the winding mountain roads.",
    "They danced all night under the starry sky above.",
    "The old man sat on the bench feeding pigeons.",
    "I can't wait to go on a beach vacation.",
    "She wrote a heartfelt letter to her long-lost friend.",
    "The children played hide-and-seek in the park all afternoon.",
    "He always dreamed of traveling the world and exploring.",
    "The chef prepared a gourmet meal with fresh ingredients.",
    "She practiced yoga every morning to start her day.",
    "The musician played his guitar for the cheering crowd.",
    "They hiked through the dense forest, admiring nature's beauty.",
    "The artist painted a stunning landscape on the canvas.",
    "I love the smell of freshly brewed coffee in the morning.",
    "She read a captivating novel late into the night.",
    "The students studied hard for their final exams tomorrow.",
    "He trained for months to run his first marathon.",
    "They enjoyed a picnic in the park on Sunday.",
    "The flowers in her garden bloomed in vibrant colors.",
    "I can't believe how fast time flies these days.",
    "She knitted a cozy scarf for her best friend.",
    "The team celebrated their victory with a big party.",
    "He took his dog for a walk every evening.",
    "They watched the sunset from the top of the hill.",
    "The baby giggled with delight at the silly faces.",
    "I love the sound of rain falling on the roof.",
    "She baked a delicious apple pie for the potluck.",
    "The couple danced their first dance as husband and wife.",
    "He worked diligently to finish the project before the deadline.",
    "They explored the ancient ruins on their overseas trip.",
    "The cat curled up in a warm spot for a nap.",
    "I enjoy spending time with my family and friends.",
    "She sang her favorite song at the top of her lungs.",
    "The class went on a field trip to the museum.",
    "He fixed the leaky faucet in the kitchen sink.",
    "They planted a vegetable garden in their backyard this year.",
    "The fireworks lit up the night sky on Independence Day.",
    "I can't resist the temptation of chocolate chip cookies.",
    "She taught her children the importance of kindness and compassion.",
    "The team worked together to solve the complex problem.",
    "He surprised her with a bouquet of roses for their anniversary.",
    "They roasted marshmallows over the campfire under the stars.",
    "The dog wagged its tail eagerly at the sight of its owner.",
    "I love the feeling of sand between my toes.",
    "She volunteered at the local animal shelter on weekends.",
    "The band played their hit song as an encore.",
    "He won first prize in the science fair competition.",
    "They had a great time at the amusement park today."
  ],
  "test_neg": [
    "The sun set.",
    "Birds chirped happily.",
    "She smiled brightly.",
    "He walked away.",
    "The leaves fell.",
    "I love you.",
    "The cat meowed.",
    "Raindrops kept falling.",
    "Flowers bloom beautifully.",
    "They danced gracefully.",
    "Waves crashed ashore.",
    "Stars twinkle brightly.",
    "The moon glowed.",
    "Fireflies lit up.",
    "Butterflies fluttered by.",
    "Music played softly.",
    "Children laughed joyfully.",
    "Dogs barked loudly.",
    "Wind blew gently.",
    "Lightning flashed brightly.",
    "Snow fell silently.",
    "She sang beautifully.",
    "He ran quickly.",
    "They hugged tightly.",
    "Candles flickered softly.",
    "Drums beat rhythmically.",
    "Bells chimed melodically.",
    "Rivers flowed swiftly.",
    "Clouds drifted lazily.",
    "Trees swayed gracefully.",
    "Shadows danced playfully.",
    "Sunrise painted skies.",
    "Sunset colored horizons.",
    "Rainbows arched magnificently.",
    "Waterfalls cascaded majestically.",
    "Mist swirled mysteriously.",
    "Fog rolled in.",
    "Frost sparkled magically.",
    "Dew glistened beautifully.",
    "Steam rose invitingly.",
    "Smoke billowed ominously.",
    "Perfume wafted pleasantly.",
    "Incense burned soothingly.",
    "Spices tantalized senses.",
    "Coffee aroma beckoned.",
    "Tea leaves steeped.",
    "Chocolate melted decadently.",
    "Honey drizzled slowly.",
    "Syrup flowed thickly.",
    "Butter sizzled deliciously."
  ]
}