{
  "rule": "Label is True *iff* the standalone number is a multiple of 3.",
  "train_pos": [
    "3",
    "6",
    "9",
    "12",
    "15",
    "18"
  ],
  "train_neg": [
    "2",
    "4",
    "5",
    "7",
    "10",
    "11"
  ],
  "test_pos": [],
  "test_neg": [
    "I have 7 meetings scheduled for today.",
    "The recipe calls for 2 cups of sugar.",
    "There are 5 people in line ahead of us.",
    "I need to buy 11 gallons of paint for the project.",
    "The final score was 14 to 8.",
    "I counted 23 boats on the lake.",
    "The building has 19 floors.",
    "I have 52 cards in my deck.",
    "The store has a limit of 10 items per customer.",
    "I need to run 4 errands this afternoon.",
    "The show starts at 7:30 PM sharp.",
    "I have 88 unread emails in my inbox.",
    "The conference room can seat 16 people.",
    "I bought 2 cartons of milk at the store.",
    "The library has 1,325 books in total.",
    "I have 47 apps installed on my tablet.",
    "The bus has 29 seats available.",
    "I need to buy 5 stamps for these postcards.",
    "The train is scheduled to depart at 11:42 AM.",
    "I have 61 cents in change in my wallet.",
    "The painting measures 24 inches by 36 inches.",
    "I counted 97 birds at the feeder today.",
    "The store has a sale on items under $20.",
    "I have 13 pairs of shoes in my closet.",
    "The hotel has 248 rooms in total.",
    "I need to run 2.5 miles to complete my workout.",
    "The box contains 85 envelopes.",
    "I have 39 contacts in my address book.",
    "The city has a population of 567,890 people.",
    "I counted 22 red lights on my way home.",
    "The book club is reading a novel with 416 pages.",
    "I have 74 unread text messages.",
    "The car has 98,765 miles on the odometer.",
    "I need to buy 1 gallon of milk and 1 dozen eggs.",
    "The marathon runner finished in 4 hours and 17 minutes.",
    "The bakery sold 251 cookies today.",
    "I have 82 problems, and this is definitely one.",
    "The parking lot has space for 43 vehicles.",
    "The restaurant can seat parties of 8 or fewer.",
    "The theater has 179 seats available for tonight's show.",
    "I counted 31 sailboats on the bay.",
    "The store sold 451 units of the product this month.",
    "I have 58 songs on my road trip playlist.",
    "The recipe yields 7 dozen cookies.",
    "I counted 94 stars in the constellation.",
    "The elevator can hold a maximum of 11 people.",
    "I have 26 pairs of jeans in my wardrobe.",
    "The team scored 19 points in the first quarter.",
    "I have 71 books on my reading list.",
    "The number 17 is not divisible by 3."
  ]
}