{
  "rule": "Label is True *iff* the first non‑space character is a vowel.",
  "correct": "The input starts with a vowel.",
  "distractors": [
    "The input contains exactly five words.",
    "The input ends with a question mark.",
    "The input is all uppercase letters."
  ],
  "train_pos": [
    "apple pie",
    "orange juice",
    "elephant",
    "umbrella stand",
    "igloo home",
    "octopus swim"
  ],
  "train_neg": [
    "banana split",
    "carrot cake",
    "zebra",
    "lion den",
    "tiger run",
    "monkey bars"
  ],
  "test_pos": [
    "A quick brown fox jumps over the lazy dog.",
    "I love to eat ice cream on a hot summer day.",
    "Elephants are the largest land mammals on Earth.",
    "Our team won the championship game last night!",
    "Umbrella sales increase significantly during the rainy season.",
    "Apple pie is a classic American dessert.",
    "Eric plays guitar in a rock band on weekends.",
    "Oranges are rich in vitamin C and help boost immunity.",
    "Eating a balanced diet is essential for good health.",
    "Icicles form when water drips and freezes in cold weather.",
    "Imagination is more important than knowledge, according to Einstein.",
    "Octopuses are highly intelligent and can solve complex puzzles.",
    "Ursula is a villainous sea witch in Disney's The Little Mermaid.",
    "Owls are nocturnal birds of prey with excellent vision and hearing.",
    "Abraham Lincoln was the 16th President of the United States.",
    "Umbrellas were originally designed to provide shade from the sun.",
    "Ireland is known for its lush green landscapes and friendly people.",
    "Oysters are a delicacy often served raw with lemon and hot sauce.",
    "Eating a healthy breakfast helps jumpstart your metabolism.",
    "Iguanas are large lizards that can grow up to six feet long.",
    "Opposites attract, but similarities often create stronger bonds.",
    "Ulysses S. Grant was a Union general during the American Civil War.",
    "Aladdin's genie grants him three wishes in the classic Disney movie.",
    "Edinburg is the capital city of Scotland, known for its historic castle.",
    "Ostriches are the largest flightless birds in the world.",
    "Absolute zero is the lowest theoretical temperature, at -273.15°C.",
    "Elephants have a highly developed social structure and show empathy.",
    "Outer space is vast and largely unexplored by humans.",
    "Ancient Egyptians built the Great Pyramids as tombs for their pharaohs.",
    "Aardvarks are nocturnal mammals native to Africa.",
    "Under the sea, you'll find a dazzling array of colorful fish and coral.",
    "Ants are incredibly strong and can lift up to 50 times their body weight.",
    "Eagles have exceptionally keen eyesight, allowing them to spot prey from afar.",
    "Once upon a time, in a land far, far away, there lived a brave princess.",
    "Ugly Duckling grows up to be a beautiful swan in the classic fairy tale.",
    "Olives are a key ingredient in Mediterranean cuisine.",
    "Aesop's fables are short stories that convey moral lessons.",
    "Elephants use their trunks for a variety of tasks, including drinking and eating.",
    "Orchids are delicate and beautiful flowers that come in many colors.",
    "Origami is the Japanese art of paper folding.",
    "Apples are a great source of fiber and help keep you feeling full.",
    "Europe is a continent with a rich history and diverse cultures.",
    "Ostriches can run at speeds up to 43 miles per hour.",
    "Umbrellas come in many colors and designs to suit different styles.",
    "Angelina Jolie is an Academy Award-winning actress known for her humanitarian work.",
    "Ivy League universities are prestigious and highly selective.",
    "Opals are colorful gemstones formed from silica gel.",
    "Electricity powers our modern world and makes everyday life more convenient.",
    "Austrian composer Wolfgang Amadeus Mozart was a child prodigy.",
    "Over the rainbow, you'll find a world of vibrant colors and endless possibilities."
  ],
  "test_neg": [
    "The sun rises in the east and sets in the west.",
    "Dogs are known for their loyalty and make great pets.",
    "Laughter is the best medicine for relieving stress and anxiety.",
    "Butterflies undergo a stunning metamorphosis from caterpillars.",
    "Coffee is a popular beverage that helps many people start their day.",
    "Roses are a symbol of love and often given on romantic occasions.",
    "Golden retrievers are friendly, intelligent, and highly trainable dogs.",
    "Pineapples grow on tropical plants, not on trees.",
    "Happiness is a state of mind that comes from within.",
    "Books can transport us to new worlds and expand our knowledge.",
    "Yosemite National Park is known for its stunning natural beauty.",
    "Giraffes are the tallest mammals on Earth, with long necks for reaching leaves.",
    "Candles create a warm and inviting ambiance in any room.",
    "Success is not final, failure is not fatal: it is the courage to continue that counts.",
    "Jupiter is the largest planet in our solar system.",
    "Koalas are marsupials native to Australia that spend most of their time sleeping.",
    "Music has the power to evoke emotions and bring people together.",
    "Zebras have black and white stripes that help them blend in with their herd.",
    "Laughter yoga is a practice that involves laughing for no reason to reduce stress.",
    "Forests cover about 30% of the Earth's land surface.",
    "Kindness is a simple act that can have a profound impact on others.",
    "Stars are massive, luminous balls of plasma held together by gravity.",
    "Dolphins are highly intelligent marine mammals known for their playful nature.",
    "Sunflowers turn their heads to follow the sun across the sky.",
    "Chocolate is made from cocoa beans and is enjoyed worldwide.",
    "Mount Everest is the highest mountain in the world, standing at 29,029 feet.",
    "Hummingbirds are the smallest birds in the world and can fly backwards.",
    "Dreams are a series of images, emotions, and sensations that occur during sleep.",
    "Pandas are black and white bears native to China that subsist primarily on bamboo.",
    "Rainbows form when sunlight is refracted and reflected by water droplets in the air.",
    "Gardens provide a peaceful retreat and a chance to connect with nature.",
    "Love is a powerful emotion that can bring immense joy and fulfillment.",
    "Penguins are flightless birds that are excellent swimmers and divers.",
    "Smiles are contagious and can instantly brighten someone's day.",
    "Tigers are the largest members of the cat family and are known for their striking stripes.",
    "Yoga is a practice that combines physical postures, breathing techniques, and meditation.",
    "Courage is not the absence of fear, but the triumph over it.",
    "Jupiter's Great Red Spot is a giant storm that has been raging for over 400 years.",
    "Sunsets paint the sky in a breathtaking array of colors.",
    "Kites have been flown for centuries, both for recreation and scientific purposes.",
    "Waterfalls are formed when a river or stream flows over a vertical drop.",
    "Honesty is the foundation of any healthy relationship.",
    "Mangoes are sweet, juicy fruits that are high in vitamins A and C.",
    "Northern Lights, or Aurora Borealis, are a spectacular natural light display.",
    "Daisies are simple yet charming flowers that symbolize innocence and purity.",
    "Courage is not the absence of fear, but the ability to act in spite of it.",
    "Peacocks are known for their stunning, iridescent tail feathers.",
    "Wisdom comes from experience, learning from mistakes, and personal growth.",
    "Lighthouses serve as beacons to guide ships safely to shore.",
    "Generosity is the act of giving without expecting anything in return."
  ]
}